VK_URL = 'https://vk.com/'
PREFIX = '/'

CONNECT_COMMAND = 'botsrecopy'

START_COMMAND = 'start'
MENU_COMMAND = 'menu'

HELLOW = 'Введите пароль.'

MENU = 'Меню'
MENU_CMD = 'menu'
MENU_TEXT = 'Меню.'

MAIN_GROUP = 'Главная группа'
MAIN_GROUP_CMD = 'maingroup'
MAIN_GROUP_TEXT = 'Напишите ссылку на группу, куда репостить посты.'
MAIN_GROUP_OK = 'Главная группа изменина.'

ADD_GROUPS = 'Добавить группу'
ADD_GROUPS_CMD = 'addgroups'
ADD_GROUPS_TEXT = 'Напишите ссылку на группу, откуда репостить посты. Если ссылок несколько, напишите их через запятую.'
ADD_GROUPS_OK = 'Добавление сохранено.'

DEL_GROUPS = 'Удалить группу'
DEL_GROUPS_CMD = 'delgroups'
DEL_NO = 'У вас нет добавленных ссылок.'
DEL_GROUPS_TEXT = 'Напишите ссылку на группу, которую хотите удалить. Если ссылок несколько, напишите их через запятую.\nДобавленные ссылки:'
DEL_GROUPS_OK = 'Удалено.'

GROUP_ERROR = ' - ошибочная ссылка. Повторите попытку.'
GROUP_NO = ' - ссылка не добавлена. Повторите попытку.'
GROUP_YET = ' - ссылка уже добавлена. Повторите попытку.'

UPDATE_CMD = 'update'

ADD_WORD = 'Добавить ключи'
ADD_WORD_CMD = 'update_0'
ADD_WORD_TEXT = 'Напишите ссылку на группу, к которой хотите добавить ключевые слова или #теги.\nВаш список ссылок:'
ADD_WORD_READ = 'Напишите ключевые слова или #теги через запятую.'
ADD_WORD_END = 'Ключи добавленны.'

ADD_STOP_WORD = 'Добавить стоп-ключи'
ADD_STOP_WORD_CMD = 'update_1'
ADD_STOP_WORD_TEXT = 'Напишите ссылку на группу, к которой хотите добавить стоп-слова или стоп-#теги.\nВаш список ссылок:'
ADD_STOP_WORD_READ = 'Напишите стоп-слова или стоп-#теги через запятую.'
ADD_STOP_WORD_END = 'Стоп-ключи добавленны.'

DEL_WORD = 'Удалиь ключи'
DEL_WORD_CMD = 'update_2'
DEL_WORD_TEXT = 'Напишите ссылку на группу, у которой хотите удалить ключевые слова или #теги.\nВаш список ссылок:'
DEL_WORD_READ = 'Напишите ключевые слова или #теги через запятую, которые хотите удалить.\nСписок слов и тегов:'
DEL_WORD_END = 'Ключи удалены.'

DEL_STOP_WORD = 'Удалить стоп-ключи'
DEL_STOP_WORD_CMD = 'update_3'
DEL_STOP_WORD_TEXT = 'Напишите ссылку на группу, у которой хотите удалить стоп-слова или стоп-#теги.\nВаш список ссылок:'
DEL_STOP_WORD_READ = 'Напишите стоп-слова или стоп-#теги через запятую, которые хотите удалить.\nСписок слов и тегов:'
DEL_STOP_WORD_END = 'Стоп-ключи удалены.'

NO_WORD = 'У вас нет добавлений.'
